salary.calculator.rus <- function(x){ # Russian salaries after tax
  
  # 13% – по доходам до 2,4 млн рублей включительно;
  # 15% – по доходам от 2,4 млн рублей до 5 млн рублей включительно;
  # 18% – по доходам от 5 млн рублей до 20 млн рублей включительно;
  # 20% – по доходам от 20 млн рублей до 50 млн рублей включительно;
  # 22% – по доходам, превышающим 50 млн рублей за налоговый период.
  
  if (isTRUE(x <= 2400000)){ y <- c(x*0.87, round(x*0.87 / 12, 2)) } 
  
  else if (isTRUE(x > 2400000) && isTRUE(x < 5000000)){ 
    
    y <- c(2088000 + x * .85, round((2088000 + x * .85) / 12, 2)) } 
  
  else if (isTRUE(x >= 5000000) && isTRUE(x <= 20000000)){ 
    
    y <- c(4298000 + x * .82, round((4298000 + x * .82) / 12, 2)) } 
  
  else if (isTRUE(x >= 20000000) && isTRUE(x <= 50000000)){ 
    
    y <- c(16598000 + x * .8, round((16598000 + x * .8) / 12, 2)) } 
  
  else { y <- c(40598000 + x*.78, round((40598000 + x*.78)/12, 2)) } 
  
  sprintf("Salary would be %s annually or %s monthly after tax", y[1], y[2])
}
salary.calculator.rus(20000000) # Test
